set_device -family {IGLOO2} -die {M2GL025}
read_verilog -mode verilog_2k -lib COREAHBLITE_LIB {C:\Users\ciaran.lappin\Documents\Boards\M2GL025_Future\Projects\MASTER\CoreRISCV_AXI4_BaseDesign\component\Actel\DirectCore\CoreAHBLite\5.2.100\rtl\vlog\core\coreahblite.v}
read_verilog -mode verilog_2k -lib COREAHBLITE_LIB {C:\Users\ciaran.lappin\Documents\Boards\M2GL025_Future\Projects\MASTER\CoreRISCV_AXI4_BaseDesign\component\Actel\DirectCore\CoreAHBLite\5.2.100\rtl\vlog\core\coreahblite_addrdec.v}
read_verilog -mode verilog_2k -lib COREAHBLITE_LIB {C:\Users\ciaran.lappin\Documents\Boards\M2GL025_Future\Projects\MASTER\CoreRISCV_AXI4_BaseDesign\component\Actel\DirectCore\CoreAHBLite\5.2.100\rtl\vlog\core\coreahblite_defaultslavesm.v}
read_verilog -mode verilog_2k -lib COREAHBLITE_LIB {C:\Users\ciaran.lappin\Documents\Boards\M2GL025_Future\Projects\MASTER\CoreRISCV_AXI4_BaseDesign\component\Actel\DirectCore\CoreAHBLite\5.2.100\rtl\vlog\core\coreahblite_masterstage.v}
read_verilog -mode verilog_2k -lib COREAHBLITE_LIB {C:\Users\ciaran.lappin\Documents\Boards\M2GL025_Future\Projects\MASTER\CoreRISCV_AXI4_BaseDesign\component\Actel\DirectCore\CoreAHBLite\5.2.100\rtl\vlog\core\coreahblite_matrix4x16.v}
read_verilog -mode verilog_2k -lib COREAHBLITE_LIB {C:\Users\ciaran.lappin\Documents\Boards\M2GL025_Future\Projects\MASTER\CoreRISCV_AXI4_BaseDesign\component\Actel\DirectCore\CoreAHBLite\5.2.100\rtl\vlog\core\coreahblite_slavearbiter.v}
read_verilog -mode verilog_2k -lib COREAHBLITE_LIB {C:\Users\ciaran.lappin\Documents\Boards\M2GL025_Future\Projects\MASTER\CoreRISCV_AXI4_BaseDesign\component\Actel\DirectCore\CoreAHBLite\5.2.100\rtl\vlog\core\coreahblite_slavestage.v}
read_verilog -mode verilog_2k -lib COREAHBTOAPB3_LIB {C:\Users\ciaran.lappin\Documents\Boards\M2GL025_Future\Projects\MASTER\CoreRISCV_AXI4_BaseDesign\component\Actel\DirectCore\COREAHBTOAPB3\3.1.100\rtl\vlog\core\coreahbtoapb3.v}
read_verilog -mode verilog_2k -lib COREAHBTOAPB3_LIB {C:\Users\ciaran.lappin\Documents\Boards\M2GL025_Future\Projects\MASTER\CoreRISCV_AXI4_BaseDesign\component\Actel\DirectCore\COREAHBTOAPB3\3.1.100\rtl\vlog\core\coreahbtoapb3_ahbtoapbsm.v}
read_verilog -mode verilog_2k -lib COREAHBTOAPB3_LIB {C:\Users\ciaran.lappin\Documents\Boards\M2GL025_Future\Projects\MASTER\CoreRISCV_AXI4_BaseDesign\component\Actel\DirectCore\COREAHBTOAPB3\3.1.100\rtl\vlog\core\coreahbtoapb3_apbaddrdata.v}
read_verilog -mode verilog_2k -lib COREAHBTOAPB3_LIB {C:\Users\ciaran.lappin\Documents\Boards\M2GL025_Future\Projects\MASTER\CoreRISCV_AXI4_BaseDesign\component\Actel\DirectCore\COREAHBTOAPB3\3.1.100\rtl\vlog\core\coreahbtoapb3_penablescheduler.v}
read_verilog -mode verilog_2k -lib COREAPB3_LIB {C:\Users\ciaran.lappin\Documents\Boards\M2GL025_Future\Projects\MASTER\CoreRISCV_AXI4_BaseDesign\component\Actel\DirectCore\CoreAPB3\4.1.100\rtl\vlog\core\coreapb3.v}
read_verilog -mode verilog_2k -lib COREAPB3_LIB {C:\Users\ciaran.lappin\Documents\Boards\M2GL025_Future\Projects\MASTER\CoreRISCV_AXI4_BaseDesign\component\Actel\DirectCore\CoreAPB3\4.1.100\rtl\vlog\core\coreapb3_iaddr_reg.v}
read_verilog -mode verilog_2k -lib COREAPB3_LIB {C:\Users\ciaran.lappin\Documents\Boards\M2GL025_Future\Projects\MASTER\CoreRISCV_AXI4_BaseDesign\component\Actel\DirectCore\CoreAPB3\4.1.100\rtl\vlog\core\coreapb3_muxptob3.v}
read_verilog -mode verilog_2k -lib COREAXITOAHBL {C:\Users\ciaran.lappin\Documents\Boards\M2GL025_Future\Projects\MASTER\CoreRISCV_AXI4_BaseDesign\component\Actel\DirectCore\COREAXITOAHBL\3.0.101\rtl\vlog\core\CoreAXItoAHBL.v}
read_verilog -mode verilog_2k -lib COREAXITOAHBL {C:\Users\ciaran.lappin\Documents\Boards\M2GL025_Future\Projects\MASTER\CoreRISCV_AXI4_BaseDesign\component\Actel\DirectCore\COREAXITOAHBL\3.0.101\rtl\vlog\core\CoreAXItoAHBL_AHBMasterCtrl.v}
read_verilog -mode verilog_2k -lib COREAXITOAHBL {C:\Users\ciaran.lappin\Documents\Boards\M2GL025_Future\Projects\MASTER\CoreRISCV_AXI4_BaseDesign\component\Actel\DirectCore\COREAXITOAHBL\3.0.101\rtl\vlog\core\CoreAXItoAHBL_AXIOutReg.v}
read_verilog -mode verilog_2k -lib COREAXITOAHBL {C:\Users\ciaran.lappin\Documents\Boards\M2GL025_Future\Projects\MASTER\CoreRISCV_AXI4_BaseDesign\component\Actel\DirectCore\COREAXITOAHBL\3.0.101\rtl\vlog\core\CoreAXItoAHBL_AXISlaveCtrl.v}
read_verilog -mode verilog_2k -lib COREAXITOAHBL {C:\Users\ciaran.lappin\Documents\Boards\M2GL025_Future\Projects\MASTER\CoreRISCV_AXI4_BaseDesign\component\Actel\DirectCore\COREAXITOAHBL\3.0.101\rtl\vlog\core\CoreAXItoAHBL_RAM_syncWrAsyncRd.v}
read_verilog -mode verilog_2k -lib COREAXITOAHBL {C:\Users\ciaran.lappin\Documents\Boards\M2GL025_Future\Projects\MASTER\CoreRISCV_AXI4_BaseDesign\component\Actel\DirectCore\COREAXITOAHBL\3.0.101\rtl\vlog\core\CoreAXItoAHBL_readByteCnt.v}
read_verilog -mode verilog_2k -lib COREAXITOAHBL {C:\Users\ciaran.lappin\Documents\Boards\M2GL025_Future\Projects\MASTER\CoreRISCV_AXI4_BaseDesign\component\Actel\DirectCore\COREAXITOAHBL\3.0.101\rtl\vlog\core\CoreAXItoAHBL_synchronizer.v}
read_verilog -mode verilog_2k -lib COREAXITOAHBL {C:\Users\ciaran.lappin\Documents\Boards\M2GL025_Future\Projects\MASTER\CoreRISCV_AXI4_BaseDesign\component\Actel\DirectCore\COREAXITOAHBL\3.0.101\rtl\vlog\core\CoreAXItoAHBL_WSTRBAddrOffset.v}
read_verilog -mode verilog_2k -lib COREAXITOAHBL {C:\Users\ciaran.lappin\Documents\Boards\M2GL025_Future\Projects\MASTER\CoreRISCV_AXI4_BaseDesign\component\Actel\DirectCore\COREAXITOAHBL\3.0.101\rtl\vlog\core\CoreAXItoAHBL_WSTRBPopCntr.v}
read_verilog -mode verilog_2k {C:\Users\ciaran.lappin\Documents\Boards\M2GL025_Future\Projects\MASTER\CoreRISCV_AXI4_BaseDesign\component\Actel\DirectCore\CoreConfigMaster\2.1.102\rtl\vlog\core\coreconfigmaster.v}
read_verilog -mode verilog_2k {C:\Users\ciaran.lappin\Documents\Boards\M2GL025_Future\Projects\MASTER\CoreRISCV_AXI4_BaseDesign\component\Actel\DirectCore\CoreConfigP\7.1.100\rtl\vlog\core\coreconfigp.v}
read_verilog -mode verilog_2k {C:\Users\ciaran.lappin\Documents\Boards\M2GL025_Future\Projects\MASTER\CoreRISCV_AXI4_BaseDesign\component\Actel\DirectCore\CoreGPIO\3.1.101\rtl\vlog\core\coregpio.v}
read_verilog -mode verilog_2k -lib COREJTAGDEBUG_LIB {C:\Users\ciaran.lappin\Documents\Boards\M2GL025_Future\Projects\MASTER\CoreRISCV_AXI4_BaseDesign\component\Actel\DirectCore\COREJTAGDEBUG\1.0.101\rtl\vlog\core\corejtagdebug.v}
read_verilog -mode verilog_2k -lib COREJTAGDEBUG_LIB {C:\Users\ciaran.lappin\Documents\Boards\M2GL025_Future\Projects\MASTER\CoreRISCV_AXI4_BaseDesign\component\Actel\DirectCore\COREJTAGDEBUG\1.0.101\rtl\vlog\core\corejtagdebug_uj_jtag.v}
read_verilog -mode verilog_2k {C:\Users\ciaran.lappin\Documents\Boards\M2GL025_Future\Projects\MASTER\CoreRISCV_AXI4_BaseDesign\component\Actel\DirectCore\CoreResetP\7.1.100\rtl\vlog\core\coreresetp.v}
read_verilog -mode verilog_2k {C:\Users\ciaran.lappin\Documents\Boards\M2GL025_Future\Projects\MASTER\CoreRISCV_AXI4_BaseDesign\component\Actel\DirectCore\CoreResetP\7.1.100\rtl\vlog\core\coreresetp_pcie_hotreset.v}
read_verilog -mode verilog_2k {C:\Users\ciaran.lappin\Documents\Boards\M2GL025_Future\Projects\MASTER\CoreRISCV_AXI4_BaseDesign\component\Actel\DirectCore\CORERISCV_AXI4\1.0.100\rtl\verilog\AsyncFifo.v}
read_verilog -mode verilog_2k {C:\Users\ciaran.lappin\Documents\Boards\M2GL025_Future\Projects\MASTER\CoreRISCV_AXI4_BaseDesign\component\Actel\DirectCore\CORERISCV_AXI4\1.0.100\rtl\verilog\CoreRISCV_AXI4.v}
read_verilog -mode verilog_2k {C:\Users\ciaran.lappin\Documents\Boards\M2GL025_Future\Projects\MASTER\CoreRISCV_AXI4_BaseDesign\component\Actel\DirectCore\CORERISCV_AXI4\1.0.100\rtl\verilog\DebugTransportModuleJtag.v}
read_verilog -mode verilog_2k {C:\Users\ciaran.lappin\Documents\Boards\M2GL025_Future\Projects\MASTER\CoreRISCV_AXI4_BaseDesign\component\Actel\DirectCore\CORERISCV_AXI4\1.0.100\rtl\verilog\Top.v}
read_verilog -mode verilog_2k -lib CORETIMER_LIB {C:\Users\ciaran.lappin\Documents\Boards\M2GL025_Future\Projects\MASTER\CoreRISCV_AXI4_BaseDesign\component\Actel\DirectCore\CoreTimer\2.0.103\rtl\vlog\core\coretimer.v}
read_verilog -mode verilog_2k {C:\Users\ciaran.lappin\Documents\Boards\M2GL025_Future\Projects\MASTER\CoreRISCV_AXI4_BaseDesign\component\User\GlueLogic\AXI_GLUE_LOGIC\1.0.7\vlog\AXI_glue_logic.v}
read_verilog -mode verilog_2k -lib MIRSLV2MIRMSTRBRIDGE_AHB_LIB {C:\Users\ciaran.lappin\Documents\Boards\M2GL025_Future\Projects\MASTER\CoreRISCV_AXI4_BaseDesign\component\USER\UserCore\MIRSLV2MIRMSTRBRIDGE_AHB\1.0.3\rtl\core\mirslv2mirmstrbridge_ahb.v}
read_verilog -mode verilog_2k {C:\Users\ciaran.lappin\Documents\Boards\M2GL025_Future\Projects\MASTER\CoreRISCV_AXI4_BaseDesign\component\work\HPMS_0_sb\CCC_0\HPMS_0_sb_CCC_0_FCCC.v}
read_verilog -mode verilog_2k {C:\Users\ciaran.lappin\Documents\Boards\M2GL025_Future\Projects\MASTER\CoreRISCV_AXI4_BaseDesign\component\work\HPMS_0_sb\FABOSC_0\HPMS_0_sb_FABOSC_0_OSC.v}
read_verilog -mode verilog_2k {C:\Users\ciaran.lappin\Documents\Boards\M2GL025_Future\Projects\MASTER\CoreRISCV_AXI4_BaseDesign\component\work\HPMS_0_sb\HPMS_0_sb.v}
read_verilog -mode verilog_2k {C:\Users\ciaran.lappin\Documents\Boards\M2GL025_Future\Projects\MASTER\CoreRISCV_AXI4_BaseDesign\component\work\HPMS_0_sb_HPMS\HPMS_0_sb_HPMS.v}
read_verilog -mode verilog_2k {C:\Users\ciaran.lappin\Documents\Boards\M2GL025_Future\Projects\MASTER\CoreRISCV_AXI4_BaseDesign\component\work\IGL2_CoreRISCV\CoreUARTapb_0\rtl\vlog\core\Clock_gen.v}
read_verilog -mode verilog_2k {C:\Users\ciaran.lappin\Documents\Boards\M2GL025_Future\Projects\MASTER\CoreRISCV_AXI4_BaseDesign\component\work\IGL2_CoreRISCV\CoreUARTapb_0\rtl\vlog\core\CoreUART.v}
read_verilog -mode verilog_2k {C:\Users\ciaran.lappin\Documents\Boards\M2GL025_Future\Projects\MASTER\CoreRISCV_AXI4_BaseDesign\component\work\IGL2_CoreRISCV\CoreUARTapb_0\rtl\vlog\core\CoreUARTapb.v}
read_verilog -mode verilog_2k {C:\Users\ciaran.lappin\Documents\Boards\M2GL025_Future\Projects\MASTER\CoreRISCV_AXI4_BaseDesign\component\work\IGL2_CoreRISCV\CoreUARTapb_0\rtl\vlog\core\fifo_256x8_g4.v}
read_verilog -mode verilog_2k {C:\Users\ciaran.lappin\Documents\Boards\M2GL025_Future\Projects\MASTER\CoreRISCV_AXI4_BaseDesign\component\work\IGL2_CoreRISCV\CoreUARTapb_0\rtl\vlog\core\Rx_async.v}
read_verilog -mode verilog_2k {C:\Users\ciaran.lappin\Documents\Boards\M2GL025_Future\Projects\MASTER\CoreRISCV_AXI4_BaseDesign\component\work\IGL2_CoreRISCV\CoreUARTapb_0\rtl\vlog\core\Tx_async.v}
read_verilog -mode verilog_2k {C:\Users\ciaran.lappin\Documents\Boards\M2GL025_Future\Projects\MASTER\CoreRISCV_AXI4_BaseDesign\component\work\IGL2_CoreRISCV\IGL2_CoreRISCV.v}
set_top_level {IGL2_CoreRISCV}
read_sdc -component {C:\Users\ciaran.lappin\Documents\Boards\M2GL025_Future\Projects\MASTER\CoreRISCV_AXI4_BaseDesign\component\work\HPMS_0_sb\CCC_0\HPMS_0_sb_CCC_0_FCCC.sdc}
read_sdc -component {C:\Users\ciaran.lappin\Documents\Boards\M2GL025_Future\Projects\MASTER\CoreRISCV_AXI4_BaseDesign\component\work\HPMS_0_sb\FABOSC_0\HPMS_0_sb_FABOSC_0_OSC.sdc}
read_sdc -component {C:\Users\ciaran.lappin\Documents\Boards\M2GL025_Future\Projects\MASTER\CoreRISCV_AXI4_BaseDesign\component\work\HPMS_0_sb_HPMS\HPMS_0_sb_HPMS.sdc}
derive_constraints
write_sdc {C:\Users\ciaran.lappin\Documents\Boards\M2GL025_Future\Projects\MASTER\CoreRISCV_AXI4_BaseDesign\constraint\IGL2_CoreRISCV_derived_constraints.sdc}
write_pdc {C:\Users\ciaran.lappin\Documents\Boards\M2GL025_Future\Projects\MASTER\CoreRISCV_AXI4_BaseDesign\constraint\fp\IGL2_CoreRISCV_derived_constraints.pdc}
